backend/load-test.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 10
      arrivalRate: 2
      name: "Warm up"
    - duration: 20
      arrivalRate: 10
      name: "Sustained load"
  processor: "./processor.js"
  plugins:
    ensure: {}
  ensure:
    maxErrorRate: 1
    p95: 1500

scenarios:
  - name: "Driver Register -> Check-in -> Poll"
    weight: 1
    afterScenario: "cleanupDriverData"
    flow:
      - function: "generateDriverData"
      - post:
          url: "/api/deliveries/register"
          json:
            vendorName: "{{ vendorName }}"
            driverName: "{{ driverName }}"
            driverPhone: "{{ driverPhone }}"
            vehiclePlate: "{{ vehiclePlate }}"
            vehicleType: "TRUCK"
            receivingUnit: "EMART"
            goodsType: "GENERAL_GOODS"
            note: "{{ loadTestId }}"
          capture:
            - json: "$.registrationCode"
              as: "registrationCode"
      - think: 2
      - patch:
          url: "/api/deliveries/check-in-lookup"
          json:
            registrationCode: "{{ registrationCode }}"
      - loop:
          - get:
              url: "/api/deliveries/queue"
          - think: 3
        count: 5

  - name: "Dashboard/Screen Polling"
    weight: 2
    flow:
      - loop:
          - get:
              url: "/api/deliveries/queue"
          - think: 2
        count: 10